Model: "collision_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
n (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
T (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
F (InputLayer)                  [(None, 15)]         0                                            
__________________________________________________________________________________________________
InputBlock (Concatenate)        (None, 17)           0           n[0][0]                          
                                                                 T[0][0]                          
                                                                 F[0][0]                          
__________________________________________________________________________________________________
HiddenBlock0 (Dense)            (None, 68)           1224        InputBlock[0][0]                 
__________________________________________________________________________________________________
HiddenBlock1 (Dense)            (None, 66)           4554        HiddenBlock0[0][0]               
__________________________________________________________________________________________________
HiddenBlock2 (Dense)            (None, 65)           4355        HiddenBlock1[0][0]               
__________________________________________________________________________________________________
HiddenBlock3 (Dense)            (None, 64)           4224        HiddenBlock2[0][0]               
__________________________________________________________________________________________________
tau (Dense)                     (None, 1)            65          HiddenBlock3[0][0]               
__________________________________________________________________________________________________
dG (Dense)                      (None, 15)           975         HiddenBlock3[0][0]               
==================================================================================================
Total params: 15,397
Trainable params: 15,397
Non-trainable params: 0
__________________________________________________________________________________________________
